cask_args appdir: "/Applications"
tap "homebrew/cask"

# Editor
tap "emacs"
cask "emacs"

# General util
brew "hub"
brew "the_silver_searcher"

# Version controls
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "yarn"

# Dev apps
cask "iterm2"
cask "spectacle"
cask "rowanj-gitx"
cask "alfred"
cask "flux"
cask "teensy"

# Productivity apps
cask "google-chrome"
cask "brave-browser"
cask "lastpass"
cask "slack"

# Music apps
cask "spotify"
cask "soundcleod"

# App store apps
brew "mas"
mas "amphetamine", id: 937984704

# VPN
cask "expressvpn"
