cask_args appdir: "/Applications"
tap "caskroom/cask"

# Editor
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ["HEAD", "with-natural-title-bars"], link: true

# General util
brew "hub"
brew "the_silver_searcher"

# Version controls
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "yarn"

# Dev apps
cask "iterm2"
cask "spectacle"
cask "rowanj-gitx"
cask "alfred"
cask "flux"
cask "teensy"

# Productivity apps
cask "google-chrome"
cask "evernote"
cask "lastpass"
cask "slack"

# Music apps
cask "spotify"
cask "soundcleod"

# App store apps
brew "mas"
mas "amphetamine", id: 937984704
mas "spark", id: 1176895641

# VPN
# https://github.com/trailofbits/algo
brew "wireguard-tools"